IDEA StatiCa Open Model
ReinfBarOnEdge.ExtendTypeEnd Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 type of extension of end of bar
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public BarEndExtendType ExtendTypeEnd { get; set; }
Public Property ExtendTypeEnd As BarEndExtendType
	Get
	Set
public:
property BarEndExtendType ExtendTypeEnd {
	BarEndExtendType get ();
	void set (BarEndExtendType value);
}
Property Value
Type: BarEndExtendType
See Also
Reference
ReinfBarOnEdge Class
IdeaRS.OpenModel.Detail Namespace